# <span style="color:red"> Pandas v0.0 </span> <br>
* ### pandas is standard library for data science in pyhton
* ### built on top of numpy

## <span style="color:blue"> Pandas has two main classes *series* and *data frame*</span>
* ### data frames is container of series object where each row is series
* ### series are like dict. data type in python

## <span style="color:green"> Pandas Series <span>

In [5]:
import pandas as pd
series = pd.Series(data=[100,200,300,400,500],index=['ubuntu','fedora','debian','rhel','gentoo'])

series_two = pd.Series([1,2,'foo',3,'bar'],['protozoa','porifera','coelenterata','nematoda','platyhelmanthis'])
print(series_two)
series

protozoa             1
porifera             2
coelenterata       foo
nematoda             3
platyhelmanthis    bar
dtype: object

ubuntu    100
fedora    200
debian    300
rhel      400
gentoo    500
dtype: int64

In [7]:
# string also get 2x, similarly other operations can also be performed
series_two*2

protozoa                2
porifera                4
coelenterata       foofoo
nematoda                6
platyhelmanthis    barbar
dtype: object

In [28]:
# both series['swfw'] and series.loc['swfw'] gives same answers
print(series['fedora'],"\n")
print(series.loc['rhel'],"\n")
print(series.loc[['ubuntu','fedora','rhel']])
# print(series.loc[[1,2,4]])        KeyError:None of [[1, 2, 4]] are in the [index]

200

400

ubuntu    100
fedora    200
rhel      400
dtype: int64

In [29]:
# to access elements at 1st, 2nd and 4th position
series[[1,2,4]]

fedora    200
debian    300
gentoo    500
dtype: int64

In [18]:
series.index

Index(['ubuntu', 'fedora', 'debian', 'rhel', 'gentoo'], dtype='object')

In [22]:
# index location 3 ki value
series.iloc[3]

400

In [23]:
'ubuntu' in series

True

## <span style="color:green"> pandas DataFrame </span>
* creating data frames from python dictionaries and pandas Series object 
* python data frame is container of pandas series with each row as series object

 > in pandas {key:values} :: key comes upper(rows)[here:: one,two] values, index of pd.Series bcom heading column
 and rest iz arranged

In [57]:
import pandas as pd 
# data frames of completely different data series
foo = pd.Series(data=[1,2,3,4,5],index=['agl','css','jmr','rkv','skd'])
bar = pd.Series(data=[100,200,300,400,500],index=['mercury','pluto','mars','jupyter','europha'])

rust = { 'one':foo,
         'two':bar }

frame= pd.DataFrame(rust)
frame

         one    two
agl      1.0    NaN
css      2.0    NaN
europha  NaN  500.0
jmr      3.0    NaN
jupyter  NaN  400.0
mars     NaN  300.0
mercury  NaN  100.0
pluto    NaN  200.0
rkv      4.0    NaN
skd      5.0    NaN

In [45]:
ruby = {'one': pd.Series([1,2,3,4],['alpha','numpy','epsilon','fie']),
       'two': pd.Series([100,200,300,400],['alpha','numpy','epsilon','seaborn'])}

new_frame = pd.DataFrame(ruby)
print(new_frame)
new_frame

         one    two
alpha    1.0  100.0
epsilon  3.0  300.0
fie      4.0    NaN
numpy    2.0  200.0
seaborn  NaN  400.0

         one    two
alpha    1.0  100.0
epsilon  3.0  300.0
fie      4.0    NaN
numpy    2.0  200.0
seaborn  NaN  400.0

In [53]:
print(new_frame.index)
print(new_frame.columns)

Index(['alpha', 'epsilon', 'fie', 'numpy', 'seaborn'], dtype='object')
Index(['one', 'two'], dtype='object')

### <span style="color:green"> Creating DataFrames from python dictionaries <span>

In [2]:
import pandas as pd
data_dict = [{'richard':100,'jared':'200','erlich': 400},{'dinesh':500,'jing-yang':600,'richard':900,'jared':888}]
panda_dict = pd.DataFrame(data_dict)
print(panda_dict)
pd.DataFrame(data_dict,index=['aneesh','jain'])
# here also key becomes upper starting row 1st column(index) start with 0,1....

   dinesh  erlich jared  jing-yang  richard
0     NaN   400.0   200        NaN      100
1   500.0     NaN   888      600.0      900

        dinesh  erlich jared  jing-yang  richard
aneesh     NaN   400.0   200        NaN      100
jain     500.0     NaN   888      600.0      900

### <span style="color:green"> Basic DataFrame operations</span>

In [25]:
import pandas as pd
foo = [{'evee':3,'vaporeon':2,'jolteon':4,'leafeon':5},
      {'evee':9,'silveon':7,'umbreon':12,'flareon':14}]
pd.DataFrame(foo)

   evee  flareon  jolteon  leafeon  silveon  umbreon  vaporeon
0     3      NaN      4.0      5.0      NaN      NaN       2.0
1     9     14.0      NaN      NaN      7.0     12.0       NaN

In [26]:
x = pd.DataFrame(foo,index=['zero','one'])

In [27]:
print(x['silveon'])
del x['silveon'],x['leafeon']

zero    NaN
one     7.0
Name: silveon, dtype: float64

In [30]:
x['epseon'] = x['evee'] + x['umbreon']

In [31]:
x

      evee  flareon  jolteon  umbreon  vaporeon  epseon
zero     3      NaN      4.0      NaN       2.0     NaN
one      9     14.0      NaN     12.0       NaN    21.0

In [33]:
x['flag'] = x['evee'] > 4
x

      evee  flareon  jolteon  umbreon  vaporeon  epseon   flag
zero     3      NaN      4.0      NaN       2.0     NaN  False
one      9     14.0      NaN     12.0       NaN    21.0   True

In [34]:
y=x.pop('umbreon')

In [36]:
print(y)
x

zero     NaN
one     12.0
Name: umbreon, dtype: float64

      evee  flareon  jolteon  vaporeon  epseon   flag
zero     3      NaN      4.0       2.0     NaN  False
one      9     14.0      NaN       NaN    21.0   True

In [37]:
x.insert(3,'power_of_evee',x['evee']**2)
x

      evee  flareon  jolteon  power_of_evee  vaporeon  epseon   flag
zero     3      NaN      4.0              9       2.0     NaN  False
one      9     14.0      NaN             81       NaN    21.0   True